DataProcessors/СкопироватьФайл_TRUCKS_XML_сСайта_AUTO_RU_ИЗагрузитьСправочники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СкопироватьФайл_TRUCKS_XML_сСайта_AUTO_RU_ИЗагрузитьСправочники</Name>
			<Comment>Скопировать файл TRUCKS.XML с сайта AUTO.RU и загрузить справочники</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПределСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Марка_АвтоРу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Марка_АвтоРу</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Модели_АвтоРу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Модели_АвтоРу</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтоРу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Марка_АвтоРу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/СкопироватьФайл_TRUCKS_XML_сСайта_AUTO_RU_ИЗагрузитьСправочники/Ext/ObjectModule.bsl
Процедура АвтоРуЗагрузкаСправочниковКоммерцияМодуль() Экспорт
	
	ВнутреннийАдресСервера = "https://auto-export.s3.yandex.net/auto/price-list/catalog/trucks.xml";
	 
 	ИмяФайлаНазначение = ПолучитьИмяВременногоФайла("xml");
	ФайлНаДиске = Новый Файл(ИмяФайлаНазначение);
	
	Для Счетчик = 1 По 10 Цикл
		КопироватьФайл(ВнутреннийАдресСервера,ИмяФайлаНазначение);
  		Если ФайлНаДиске.Существует() Тогда
 			Прервать;
		КонецЕсли;
		Пауза30секунд = 30;
		КонДата = ТекущаяДата() + Пауза30секунд;
  		Пока ТекущаяДата() < КонДата Цикл
      		//...  
  		КонецЦикла;
 	КонецЦикла; 
	
	Если НЕ ФайлНаДиске.Существует() Тогда
		#Если НаКлиенте Тогда
			Попытка
		       Сообщить("ОШИБКА! Информация с сайта не скопирована в файл: <"+СокрЛП(ИмяФайлаНазначение)+">",СтатусСообщения.ОченьВажное);
 			Исключение
				//				
			КонецПопытки;		 
 		#КонецЕсли
  		Возврат;
	Иначе
		#Если НаКлиенте Тогда
			Попытка
		       Сообщить("Информация с сайта скопирована в файл: <"+СокрЛП(ФайлНаДиске.ПолноеИмя)+">");
 			Исключение
				//				
			КонецПопытки;		 
 		#КонецЕсли
	КонецЕсли;  
  	
	ёё = 0;
	
	МаркаАвтоРу = Справочники.Марка_АвтоРу.ПустаяСсылка();
	 
	ЧтениеXML = Новый ЧтениеXML();
	
	ЧтениеXML.ОткрытьФайл(ИмяФайлаНазначение);
	
	 Пока ЧтениеXML.Прочитать() Цикл
	 	
	 	Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ТекущееИмя = ЧтениеXML.Имя;
   
 			ТекущееЗначение = ЧтениеXML.Значение;
			
			Если ТекущееИмя = "mark" Тогда
				НаименованиеМарки = ЧтениеXML.ПолучитьАтрибут(0);
				АртикулМарки = ЧтениеXML.ПолучитьАтрибут(1);
 	 			МаркаАвтоРуКоммерция = НайтиИлиСоздатьМаркуАвтоРуКоммерция(НаименованиеМарки,АртикулМарки);
			ИначеЕсли ТекущееИмя = "group" Тогда
				НаименованиеМодели = ЧтениеXML.ПолучитьАтрибут(0);
				АртикулМодели = ЧтениеXML.ПолучитьАтрибут(1);
				КатегорияМодели = ЧтениеXML.ПолучитьАтрибут(2);
 	  			МодельАвтоРуКоммерция = НайтиИлиСоздатьМодельАвтоРуКоммерция(НаименованиеМодели,АртикулМодели,КатегорияМодели,МаркаАвтоРуКоммерция);
 			КонецЕсли; 
			
	   	КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();	

КонецПроцедуры

Функция НайтиИлиСоздатьМаркуАвтоРуКоммерция(Наименование,Артикул) Экспорт
	
	НовМарка = Справочники.Марка_АвтоРу.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Марка_АвтоРу.Ссылка,
		|	Марка_АвтоРу.Наименование,
		|	Марка_АвтоРу.Артикул,
		|	Марка_АвтоРу.Коммерция
		|ИЗ
		|	Справочник.Марка_АвтоРу КАК Марка_АвтоРу
		|ГДЕ
		|	Марка_АвтоРу.Наименование = &Наименование
		|	И Марка_АвтоРу.Артикул = &Артикул
		|	И Марка_АвтоРу.Коммерция";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМарка = ВыборкаДетальныеЗаписи.Ссылка;
		Возврат НовМарка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМарка) Тогда
		
		НовМарка = Справочники.Марка_АвтоРу.СоздатьЭлемент();
		НовМарка.УстановитьНовыйКод("ЦБ");
		НовМарка.Наименование = Наименование;
		НовМарка.Артикул = Артикул;
		НовМарка.Коммерция=Истина;
		
		Попытка НовМарка.Записать(); Исключение  КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовМарка.Ссылка;

КонецФункции // НайтиИлиСоздатьМаркуАвтоРуКоммерция(Наименование,Артикул)


Функция НайтиИлиСоздатьМодельАвтоРуКоммерция(Наименование,Артикул,Категория,Марка) Экспорт
	
	НовМодель = Справочники.Модели_АвтоРу.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Модель_АвтоРу.Ссылка,
		|	Модель_АвтоРу.Наименование,
		|	Модель_АвтоРу.Артикул,
		|	Модель_АвтоРу.Категория,
		|	Модель_АвтоРу.Коммерция
		|ИЗ
		|	Справочник.Модели_АвтоРу КАК Модель_АвтоРу
		|ГДЕ
		|	Модель_АвтоРу.Наименование = &Наименование
		|	И Модель_АвтоРу.МаркаАвтоРу = &Марка
		|	И Модель_АвтоРу.Артикул = &Артикул
		|	И Модель_АвтоРу.Коммерция";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("Марка", Марка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМодель = ВыборкаДетальныеЗаписи.Ссылка;
		Если НЕ ОбЗначениеНеЗаполнено(Категория) Тогда
			Если ОбЗначениеНеЗаполнено(НовМодель.Категория) Тогда
			   СпрОбъект = НовМодель.ПолучитьОбъект();
			   СпрОбъект.Категория = Категория;
			   Попытка	СпрОбъект.Записать(); Исключение КонецПопытки;
			КонецЕсли; 
		КонецЕсли; 
		Возврат НовМодель;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМодель) Тогда
		
		НовМодель = Справочники.Модели_АвтоРу.СоздатьЭлемент();
		НовМодель.УстановитьНовыйКод("ЦБ");
		НовМодель.Наименование = Наименование;
		НовМодель.МаркаАвтоРу = Марка; 
		НовМодель.Категория = Категория; 
		НовМодель.Коммерция = Истина;
		НовМодель.Артикул = Артикул; 
		
		Попытка	НовМодель.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовМодель.Ссылка;

КонецФункции // НайтиИлиСоздатьМодельАвтоРуКоммерция(Наименование,Артикул,Марка)

//Функция НайтиИлиСоздатьМодификацию(Наименование,Модель) Экспорт
//	
//	НовМодификация = Справочники.Модификации_АвтоРу.ПустаяСсылка();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Модификация_АвтоРу.Ссылка,
//		|	Модификация_АвтоРу.Наименование,
//		|	Модификация_АвтоРу.Владелец
//		|ИЗ
//		|	Справочник.Модификации_АвтоРу КАК Модификация_АвтоРу
//		|ГДЕ
//		|	Модификация_АвтоРу.Наименование = &Наименование
//		|	И Модификация_АвтоРу.Владелец = &Модель";
//	
//	Запрос.УстановитьПараметр("Наименование", Наименование);
//	Запрос.УстановитьПараметр("Модель", Модель);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		НовМодификация = ВыборкаДетальныеЗаписи.Ссылка;
//		Возврат НовМодификация;
//	КонецЦикла;
//	
//	Если обЗначениеНеЗаполнено(НовМодификация) Тогда
//		
//		НовМодификация = Справочники.Модификации_АвтоРу.СоздатьЭлемент();
//		НовМодификация.УстановитьНовыйКод("ЦБ");
//		НовМодификация.Наименование = Наименование;
//		НовМодификация.Владелец = Модель; 
//		
//		Попытка	НовМодификация.Записать(); Исключение КонецПопытки;
//		
//	КонецЕсли; 
// 
//	Возврат НовМодификация.Ссылка;

//КонецФункции // НайтиИлиСоздатьМодификацию(Наименование,Модель)

//Функция НайтиИлиСоздатьКомплектацию(Наименование,Модификация) Экспорт
//	
//	НовКомплектация = Справочники.Комплектации_АвтоРу.ПустаяСсылка();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	Комплектация_АвтоРу.Ссылка,
//		|	Комплектация_АвтоРу.Наименование,
//		|	Комплектация_АвтоРу.Владелец
//		|ИЗ
//		|	Справочник.Комплектации_АвтоРу КАК Комплектация_АвтоРу
//		|ГДЕ
//		|	Комплектация_АвтоРу.Наименование = &Наименование
//		|	И Комплектация_АвтоРу.Владелец = &Модификация";
//	
//	Запрос.УстановитьПараметр("Наименование", Наименование);
//	Запрос.УстановитьПараметр("Модификация", Модификация);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		НовКомплектация = ВыборкаДетальныеЗаписи.Ссылка;
//		Возврат НовКомплектация;
//	КонецЦикла;
//	
//	Если обЗначениеНеЗаполнено(НовКомплектация) Тогда
//		
//		НовКомплектация = Справочники.Комплектации_АвтоРу.СоздатьЭлемент();
//		НовКомплектация.УстановитьНовыйКод("ЦБ");
//		НовКомплектация.Наименование = Наименование;
//		НовКомплектация.Владелец = Модификация; 
//		
//		Попытка	НовКомплектация.Записать(); Исключение	КонецПопытки;
//		
//	КонецЕсли; 
// 
//	Возврат НовКомплектация.Ссылка;

//КонецФункции // НайтиИлиСоздатьКомплектацию(Наименование,Модификация)
